// - Нам дано масив друзів let friends = ["Ivan", "Slavik", "Grisha", "Lera", "Ira"]; Потрібно зробити перевірку якщо
// кількість елементів у масиві більше або дорівнює 3, то виводиться повідомлення про те, що це великий масив, в якому  3 і більше елементи.
//     Інакше слід вивести на екран повідомлення про те, що це маленький масив, в якому менше 3-х елементів.
// let friend = ['2'];
// let friends = ["Ivan", "Slavik", "Grisha", "Lera", "Ira"];
// if (friend >= [''] [''] ['']) {
//     console.log('це великий масив')
// } else if (friend <= [''] ['']) {
//     console.log('це маленький масив');
// }
// console.log('friends');


// - Маємо 3 числа і між ним  нам потрібно знайти те що посередині.
//     Знайти, яке з них є середнім (більше одного, але менше за інше). Перевірити, чи знаходиться перше число між двома іншими.
//
// let num = 1;
// if (num === 1) {
//     console.log('first')
// } else if (num === 2) {
//     console.log(two);
// } else if (num === 3) {
//     console.log('three');
// }


// - Перепишіть конструкцію if з використанням умовного оператора '?':
// let result;
// if (a + b < 4) {
//     result = 'Мало';
// } else {
//     result = 'Багато';
// }
// let result = 2;
// let qwe = result < 4 ? 'Мало' : 'Багато';
// console.log(qwe);


// - Маємо будь яке число від -100 , 0 , +100 потрібно перевірити яким є число: позитивним, негативним або нулем
// напишіть це тернарним оператором

// let num = -40;
// let qwe = num >= -100 ? 'негативним' : num === 0 ? 'нулем' : num <= 100 ? 'позитивним' : 'інше число';
// console.log(qwe);


// - створити функцію, яка якщо приймає один аргумент, просто вивдоить його, якщо два аргументи - складає або конкатенує їх між собою.
// let sss = prompt('dasd')
// let xxx = (...arguments) => {
//     // let qwe = arguments[0];
//     for (let i = 0; i < arguments.length; i++) {
//         if (arguments < 2) {
//             return arguments;
//         } else if (arguments >= 2) {
//             return arguments + arguments;
//         }
//     }
// };
// let fff = xxx(sss);
// console.log(fff);

// - створити функцію  яка приймає два масиви та скаладає значення елементів з однаковими індексами  та повертає новий результуючий масив.
//     EXAMPLE:
// [1,2,3,4]
//     [2,3,4,5]
// результат
//     [3,5,7,9]


let num1 = [1, 2, 3, 4];
let num2 = [2, 3, 4, 5];
let check = (n1, n2) => {

    console.log(n1[0] + n2[0],n1[1] + n2[1], n1[2] + n2[2], n1[3] + n2[3],) ;

};
check(num1, num2);


