// - Дано змінну time яка рівна числу від 0 до 59. Потрібно написати код, який перевірить, до якої четверті години попадає число
// (в першу, другу, третю или четверту частину години).
//
// let time = prompt('writetime');
// if (time <= 15) {
//     document.write('<h1>перша частина години</h1>')
// } else if (time > 15 && time <= 30) {
//     document.write('<h1>друга частина години</h1>')
// } else if (time > 30 && time <= 45) {
//     document.write('<h1>третя частина години</h1>')
// } else if (time > 45 && time <= 59) {
//     document.write('<h1>четверта частина години</h1>')
// }

// - У змінній day дано якесь число від 1 до 31. Потрібно визначити, у яку половину(декаду) місяця потрапляє це число
// (у першу, другу чи третю).

// let day = prompt('number day');
// if (day <= 10) {
//     document.write('<h1>first decade</h1>');
// } else if (day >= 11 && day <= 20) {
//     document.write('<h1> second decade</h1>');
// } else if (day >= 21 && day <= 31) {
//     document.write('<h1>third decade</h1>');
// }



// - У нас є змінна test, якщо  не дорівнює true, виведіть 'Вірно', інакше виведіть 'Неправильно'.
//     Перевірте роботу скрипта при test, що дорівнює true, false. Напишіть два варіанти скрипта - з коротким записом
// (тернаркою)

// проба перша
// let test = '';
// if (test !== true) {
//     document.write('Вірно')
// }
// else if (test === true) {
//     document.write('Неправильно')
// }

// проба друга
// let test = prompt('Вірно') || ('Неправильно');
// if (test ===  true) || (test !== true)
// document.write(test);
// let test = 1;
// console.log(test === !true) || (test !== !false);
// document.write(test)

// перемога!
// let test = 'tre';
// let qwe = test === 'true' ? 'Вірно' : 'Неправильно';
// console.log(qwe);

// - Якщо змінна a не дорівнює нулю, виведіть 'Вірно', інакше виведіть 'Невірно'. Перевірте  скрипт при a, що дорівнює 1, 0, -3
// let a = 0;
// let qqq = a === 0 ? 'Вірно' : 'Невірно';
// console.log(qqq);

// let a = 0;
// let num = a === 1 ? 'Вірно' : 'Невірно';
// console.log(num);

// let a = -3;
// let num = a === 3 ? 'Вірно' : 'Невірно';
// console.log(num);


// - Скласти розклад на тиждень за домопоги switch. Користувач вводить порядковий номер дня тижня і на екрані відображається інфа що заплановано на цей день.

// let number = prompt('write number day');
// switch (number) {
//     case 'monday':
//         console.log('зробити зарядку, почистити зуби, зїсти сніданок');
//         console.log('поїхати на роботу, зїсти обід, повернутися до дому');
//         console.log('піти в зал, зїсти вечерю, лягти спати');
//         break;
//     case 'tuesday':
//         console.log('зробити зарядку, поснідати');
//         console.log('зібрати речі в подорож, сходити в машазин')
//         console.log('ввечері заправити машину і виїхати в Польщу')
//         break;
//     case 'wednesday':
//         console.log('приїхати в краків до 10 ранку, поснідати');
//         console.log('погуляти в старом місті і вавель');
//         console.log('пообідати і ввечері виїхати в Прагу');
//         break;
//     case 'Thursday':
//         console.log('вночі посилитися в готель, і відпочити до ранку');
//         console.log('поснідати, піти в місто погуляти');
//         console.log('посидіти в місцевомі ресторані, спробувати місцеву кухню і звичайно випити пиво');
//         console.log('повернутися до готелю відпочити');
//         console.log('ввечері піти у місцевий паб, подивитися футбол і випити ще пива)))');
//         break;
//     case 'fridey':
//         console.log('прокинутися, поснідати і виїхати в Мюнхен');
//         console.log('в обід заправити авто і пообідати');
//         console.log('приїхати в Мюнхен і заселитися в готель');
//         console.log('вночі прогулятися містом і спробувати місцеву кухню');
//         break;
//     case 'saturday':
//         console.log('поснідати і відвідати музей з форфоровими виробами');
//         console.log('пообідати і погуляти містом, подивитися на місто з найбільшого будинку в місті');
//         console.log('ввечері піти на фтбол і відчути атмосферу');
//         break;
//     case 'sunday':
//         console.log('зібрати речі і виїхати у Париж');
//         console.log('заправити авто і пообідати');
//         console.log('приїхати в Париж');
//         console.log('посидіти в ресторані з видом на Ейфелеву вежу');
//         console.log('прийти в отель і лягти спати');
//         break;
// }
// - Потрібно визначити Високосний рік чи ні. Високосні роки діляться націло на 4.
// let year = 2024;
// let num = year % 4 ? 'нормальний рік' : 'Високосний рік';
// console.log(num);

// - Використовуючи конструкцію if..else, напишіть код, який запитуватиме: „Яка «офіційна» назва JavaScript?“
// Якщо користувач вводить «ECMAScript», то показати: «Правильно!», інакше – відобразити: «Не знаєте? ECMAScript!

// let qwe = prompt('Яка «офіційна» назва JavaScript?');
// if (qwe === 'ECMAScript') {
//     document.write('Правильно');
// } else {
//     document.write(qwe = 'Не знаєте? ECMAScript!');
// }